# 1) Descargar base de datos

In [10]:
!gdown 1puf9UBuzaVqMW3ZMMXhd626E5yVJd_QX

Downloading...
From: https://drive.google.com/uc?id=1puf9UBuzaVqMW3ZMMXhd626E5yVJd_QX
To: /content/data_berka.db
100% 70.2M/70.2M [00:00<00:00, 151MB/s]

1.1) Cargamos la extension sql(nos permite ejecutar comandos sql directamente en colab)

In [21]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

1.2) Conectar a la Base de datos

In [8]:
%sql sqlite:///data_berka.db

1.3) Comprobamos el esquema de la BBDD
Para ejecutar comandos sql, se debe aÃ±adir "%sql comando" o en multiples lineas "%%sql
"comando_linea1
comando_linea2"

In [23]:
%%sql
SELECT name, type
FROM sqlite_master
WHERE type = "table"

 * sqlite:///data_berka.db
Done.

[('DISTRICT', 'table'),
 ('ACCOUNT', 'table'),
 ('TRANS', 'table'),
 ('CLIENT', 'table'),
 ('DISPOSITION', 'table'),
 ('CREDIT_CARD', 'table'),
 ('LOAN', 'table'),
 ('PERMANENT_ORDER', 'table')]

# 2) Ejercicicos

2.1) Muestre los datos de la tabla cliente

In [24]:
%sql SELECT * FROM CLIENT LIMIT 5

 * sqlite:///data_berka.db
Done.

[(1, '706213', 18),
 (2, '450204', 1),
 (3, '406009', 1),
 (4, '561201', 5),
 (5, '605703', 5)]

2.2) Liste todos los clientes con cuentas activas y prestamos, inluyendo dinero prestado y saldos de cuenta

In [26]:
%%sql
SELECT name, type
FROM sqlite_master
WHERE type = "table" #account_id, loan_id y amount

 * sqlite:///data_berka.db
Done.

[('DISTRICT', 'table'),
 ('ACCOUNT', 'table'),
 ('TRANS', 'table'),
 ('CLIENT', 'table'),
 ('DISPOSITION', 'table'),
 ('CREDIT_CARD', 'table'),
 ('LOAN', 'table'),
 ('PERMANENT_ORDER', 'table')]

In [50]:
%%sql
select c.client_id as cliente,
ROUND(SUM(l.amount), 2) as importe_prestado,
ROUND(SUM(CASE
  WHEN t.type = 'PRIJEM' THEN t.amount
  WHEN t.type = 'VYDAJ' then -t.amount
  else 0
  end), 2) as balance_cuenta
from CLIENT c
left join  disposition d on d.client_id = c.client_id
left join ACCOUNT a on a.account_id = d.account_id
left join loan l on l.account_id = a.account_id
left join trans t on t.account_id = a.account_id
where d.type = 'OWNER'
group by c.client_id
limit 5

 * sqlite:///data_berka.db
Done.

[(1, None, 13466.5),
 (2, 38695056.0, 260069.7),
 (4, None, 51096.2),
 (6, None, 33720.6),
 (7, None, 28088.6)]

In [58]:
%%sql
select c.client_id as cliente, COUNT(a.account_id) as total_cuentas
from client c
left join disposition d on d.client_id = c.client_id
left join ACCOUNT a on a.account_id = d.account_id
group by c.client_id
having total_cuentas > 1

 * sqlite:///data_berka.db
Done.

[]

In [87]:
%%sql
SELECT trans_id, date, amount
FROM trans
where date like '98%'
ORDER BY amount DESC
LIMIT 10;

 * sqlite:///data_berka.db
Done.

[(291346, 981215, 87400.0),
 (1306770, 980606, 87300.0),
 (1207200, 980619, 85800.0),
 (1170721, 980615, 81900.0),
 (706371, 980610, 80100.0),
 (141211, 980625, 78300.0),
 (1155373, 980618, 78000.0),
 (623347, 980612, 77400.0),
 (768915, 980620, 77100.0),
 (816974, 980621, 76800.0)]

In [95]:
%%sql
SELECT
  CASE
    WHEN t.account_id IN (SELECT account_id FROM loan) THEN 'Con prÃ©stamo'
    ELSE 'Sin prÃ©stamo'
  END AS tipo_cuenta,
  AVG(balance) AS saldo_promedio
FROM trans t
GROUP BY tipo_cuenta;

 * sqlite:///data_berka.db
Done.

[('Con prÃ©stamo', 45467.142583891895), ('Sin prÃ©stamo', 36979.082419248676)]